coding-challenges.org
#+TITLE: Coding Challenges

This is a place for me to record my work on various coding challenges
for later reference.

* Reverse a 32-bit Integer
Link: https://leetcode.com/problems/reverse-integer/

I used this one to try out Racket, rather than to practice word size
constraint as the problem instructs. Leetcode unfortunately requires
that your solution be called ~reverse~, which causes the builtin
function of the same name to be shadowed. So we have to reimplement
list reversal with a new name:
#+begin_src scheme
  (define/contract (reverse-list l)
    (-> list? list?)
    (reverse-list-helper l '()))

  (define/contract (reverse-list-helper l aux)
    (-> list? list? list?)
    (if (null? l)
        aux
        (reverse-list-helper (cdr l) (cons (car l) aux))))
#+end_src
And then solve the problem:
#+begin_src scheme
  (define/contract (reverse x)
    (-> exact-integer? number?)
      (let* ([s (number->string x)]
             [y (string->number
                 (if (< x 0)
                     (string-join (list "-" (reverse-string (substring s 1))) "")
                     (reverse-string s)))])
        (if (or (< y -2147483648) (>= y 2147483648)) 0 y)))

  (define/contract (reverse-string s)
    (-> string? string?)
    (list->string (reverse-list (string->list s))))
#+end_src

* Sierpinski Triangles
Link:
https://www.hackerrank.com/challenges/functions-and-fractals-sierpinski-triangles/submissions/code/298875887

The tricky part of this problem is choosing a way to represent and
draw triangles that can be reused across iterations. One useful
observation is that at each iteration, the canvas can cleanly be
divided into rows of triangles. Using this observation, we need to
devise a way of drawing a row of triangles and identify how these rows
change at each "iteration" of generating the fractal.
#+begin_src clojure
  (def n (Integer/parseInt (read-line)))

  (def num-rows 32)
  (def num-cols 63)

  (def mark "1")
  (def unmark "_")

  (def marks (repeat mark))
  (def unmarks (repeat unmark))

  (defn draw-line [height vertices width line]
      (if (empty? vertices)
          (let [num-left (- num-cols width)
                complete (concat (take num-left unmarks) line)]
              (apply str (reverse complete)))
          (let [v (- (first vertices) height)
                num-unmark (- v width)
                num-mark (inc (* 2 height))
                more (concat (take num-mark marks)
                             (take num-unmark unmarks))]
              (recur height (rest vertices) (+ width (count more)) (concat more line)))))

  (defn draw-row [height vertices]
      (clojure.string/join "\n" (for [h (range height)]
                                    (draw-line h vertices 0 '()))))

  (defn draw-rows [height sets]
      (clojure.string/join "\n" (for [s sets]
                                    (draw-row height s))))

  (def n0 (draw-rows 32 '((31))))

  (def n1 (draw-rows 16 '((31)
                          (15 47))))
                           
  (def n2 (draw-rows 8 '((31)
                         (23 39)
                         (15 47)
                         (7 23 39 55))))

  (defn fractalize [num-iter curr-iter height verts]
      (if (= curr-iter num-iter)
          (draw-rows height verts)
          (let [new-verts (apply concat (for [l verts]
                                            (list l (apply concat (for [v l]
                                                                      (list (- v (/ height 2))
                                                                      (+ v (/ height 2))))))))]
              (fractalize num-iter (inc curr-iter) (/ height 2) new-verts))))

  (defn draw-fractal [n]
    (fractalize n 0 num-rows (list (list (dec num-rows)))))

  (println (draw-fractal n))
#+end_src

* Unique Paths in Chicago
Link: https://leetcode.com/problems/unique-paths/

I posed this question in a practice interview because I wanted to know
how many different ways I could walk to the Y before I had to start
repeating routes. Later I found it on Leetcode:
https://leetcode.com/problems/unique-paths/

The best solution I've found frames this problem as moving along one
axis, and choosing at which of the cross streets to move along the
other axis. This is an combinations with replacement problem, also
known as multichoose. n multichoose k can also be thought of as a
stars and bars problem with ~n+k-1~ objects: choose ~k~ of the objects
to be stars (representing chosen elements), leaving ~n-1~ to be bars
(separating each of ~n~ cells which contain some number of the ~k~
elements). This [[https://math.stackexchange.com/a/3903700][stackoverflow post]] has more detail.

I'm tempted to call this solution constant-time, but really the number
of operations it performs grows as ~m+n~:
#+begin_src python
  def comb(n,k):
      res = 1
      i = n
      while i > n - k:
          res *= i
          i -= 1
      i = k
      while i > 1:
          res = res // i
          i -= 1
      return res

  class Solution:
      def uniquePaths(self, m: int, n: int) -> int:
          return comb(m+n-2,m-1)
#+end_src

