coding-challenges.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-23 Sat 00:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Coding Challenges</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Coding Challenges</h1>
<p>
This is a place for me to record my work on various coding challenges
for later reference.
</p>

<div id="outline-container-org56dfb81" class="outline-2">
<h2 id="org56dfb81">Reverse a 32-bit Integer</h2>
<div class="outline-text-2" id="text-org56dfb81">
<p>
Link: <a href="https://leetcode.com/problems/reverse-integer/">https://leetcode.com/problems/reverse-integer/</a>
</p>

<p>
I used this one to try out Racket, rather than to practice word size
constraint as the problem instructs. Leetcode unfortunately requires
that your solution be called <kbd>reverse</kbd>, which causes the builtin
function of the same name to be shadowed. So we have to reimplement
list reversal with a new name:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(define/contract (reverse-list l)
  (-&gt; list? list?)
  (reverse-list-helper l '()))

(define/contract (reverse-list-helper l aux)
  (-&gt; list? list? list?)
  (if (null? l)
      aux
      (reverse-list-helper (cdr l) (cons (car l) aux))))
</pre>
</div>
<p>
And then solve the problem:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(define/contract (reverse x)
  (-&gt; exact-integer? number?)
    (let* ([s (number-&gt;string x)]
           [y (string-&gt;number
               (if (&lt; x 0)
                   (string-join (list "-" (reverse-string (substring s 1))) "")
                   (reverse-string s)))])
      (if (or (&lt; y -2147483648) (&gt;= y 2147483648)) 0 y)))

(define/contract (reverse-string s)
  (-&gt; string? string?)
  (list-&gt;string (reverse-list (string-&gt;list s))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb65d519" class="outline-2">
<h2 id="orgb65d519">Sierpinski Triangles</h2>
<div class="outline-text-2" id="text-orgb65d519">
<p>
Link:
<a href="https://www.hackerrank.com/challenges/functions-and-fractals-sierpinski-triangles/submissions/code/298875887">https://www.hackerrank.com/challenges/functions-and-fractals-sierpinski-triangles/submissions/code/298875887</a>
</p>

<p>
The tricky part of this problem is choosing a way to represent and
draw triangles that can be reused across iterations. One useful
observation is that at each iteration, the canvas can cleanly be
divided into rows of triangles. Using this observation, we need to
devise a way of drawing a row of triangles and identify how these rows
change at each "iteration" of generating the fractal.
</p>
<div class="org-src-container">
<pre class="src src-clojure">(def n (Integer/parseInt (read-line)))

(def num-rows 32)
(def num-cols 63)

(def mark "1")
(def unmark "_")

(def marks (repeat mark))
(def unmarks (repeat unmark))

(defn draw-line [height vertices width line]
    (if (empty? vertices)
        (let [num-left (- num-cols width)
              complete (concat (take num-left unmarks) line)]
            (apply str (reverse complete)))
        (let [v (- (first vertices) height)
              num-unmark (- v width)
              num-mark (inc (* 2 height))
              more (concat (take num-mark marks)
                           (take num-unmark unmarks))]
            (recur height (rest vertices) (+ width (count more)) (concat more line)))))

(defn draw-row [height vertices]
    (clojure.string/join "\n" (for [h (range height)]
                                  (draw-line h vertices 0 '()))))

(defn draw-rows [height sets]
    (clojure.string/join "\n" (for [s sets]
                                  (draw-row height s))))

(def n0 (draw-rows 32 '((31))))

(def n1 (draw-rows 16 '((31)
                        (15 47))))

(def n2 (draw-rows 8 '((31)
                       (23 39)
                       (15 47)
                       (7 23 39 55))))

(defn fractalize [num-iter curr-iter height verts]
    (if (= curr-iter num-iter)
        (draw-rows height verts)
        (let [new-verts (apply concat (for [l verts]
                                          (list l (apply concat (for [v l]
                                                                    (list (- v (/ height 2))
                                                                    (+ v (/ height 2))))))))]
            (fractalize num-iter (inc curr-iter) (/ height 2) new-verts))))

(defn draw-fractal [n]
  (fractalize n 0 num-rows (list (list (dec num-rows)))))

(println (draw-fractal n))
</pre>
</div>
</div>
</div>

<div id="outline-container-org0d32397" class="outline-2">
<h2 id="org0d32397">Unique Paths in Chicago</h2>
<div class="outline-text-2" id="text-org0d32397">
<p>
Link: <a href="https://leetcode.com/problems/unique-paths/">https://leetcode.com/problems/unique-paths/</a>
</p>

<p>
I posed this question in a practice interview because I wanted to know
how many different ways I could walk to the Y before I had to start
repeating routes. Later I found it on Leetcode:
<a href="https://leetcode.com/problems/unique-paths/">https://leetcode.com/problems/unique-paths/</a>
</p>

<p>
The best solution I've found frames this problem as moving along one
axis, and choosing at which of the cross streets to move along the
other axis. This is an combinations with replacement problem, also
known as multichoose. n multichoose k can also be thought of as a
stars and bars problem with <kbd>n+k-1</kbd> objects: choose <kbd>k</kbd> of the objects
to be stars (representing chosen elements), leaving <kbd>n-1</kbd> to be bars
(separating each of <kbd>n</kbd> cells which contain some number of the <kbd>k</kbd>
elements). This <a href="https://math.stackexchange.com/a/3903700">stackoverflow post</a> has more detail.
</p>

<p>
I'm tempted to call this solution constant-time, but really the number
of operations it performs grows as <kbd>m+n</kbd>:
</p>
<div class="org-src-container">
<pre class="src src-python">def comb(n,k):
    res = 1
    i = n
    while i &gt; n - k:
        res *= i
        i -= 1
    i = k
    while i &gt; 1:
        res = res // i
        i -= 1
    return res

class Solution:
    def uniquePaths(self, m: int, n: int) -&gt; int:
        return comb(m+n-2,m-1)
</pre>
</div>
</div>
</div>
