coding-challenges.org
* Construct Binary Tree from Inorder and Preorder Traversals
Link:
https://leetcode.com/problems/construct-binary-tree-from-preorder-and-inorder-traversal/

At first, I tried a solution where I constructed a candidate tree
(leftward descending linked list according to preorder) and then using
the inorder traversal to graft the tree so that it satisfied the
inorder.

In thinking over that solution, I observed that when we start, we know
that the first element of the preorder must be the root; moreover, all
of the elements appearing before the root in the inorder must belong
to the left subtree, and the rest to the right.

A recursive structure was beginning to appear. Now we know how many
elements ~k~ are in the left subtree; the next ~k~ elements of the
preorder travsersal (after the first) must therefore represent a
preorder traversal of the left subtree.

#+begin_src python
  # Definition for a binary tree node.
  class TreeNode:
      def __init__(self, val=0, left=None, right=None):
          self.val = val
          self.left = left
          self.right = right
#+end_src

#+begin_src python
def traverse(preorder,inorder):
    if preorder == []:
        return None
    val = preorder[0]
    pivot = inorder.index(val)
    inorderLeft = inorder[:pivot]
    inorderRight = inorder[pivot+1:]
    preorderLeft = [i for i in preorder if i in inorderLeft]
    preorderRight = [i for i in preorder if i in inorderRight]    
    return TreeNode(val,traverse(preorderLeft,inorderLeft),traverse(preorderRight,inorderRight))

class Solution:
    def buildTree(self, preorder: List[int], inorder: List[int]) -> Optional[TreeNode]:
        return traverse(preorder,inorder)
      
#+end_src

That solution passed all but one test case, and exceeded the time
limit. How can we avoid creating so many copies of the traversals?

#+begin_src python
  # Definition for a binary tree node.
  class Solution:
      # [left,right)
      def traverse(self,pleft,pright,ileft,iright):
          if pleft >= pright:
              return None
          val = self.preorder[pleft]
          pivot = self.inorder.index(val)
          numLeft = pivot-ileft
          leftNode = self.traverse(pleft+1,pleft+1+numLeft,ileft,pivot)
                        # traverse(preorderLeft,inorderLeft)
          rightNode = self.traverse(pleft+1+numLeft,pright,pivot+1,iright)
                         # traverse(preorderRight,inorderRight)
          return TreeNode(val,leftNode,rightNode)
      def buildTree(self, preorder: List[int], inorder: List[int]) -> Optional[TreeNode]:
          self.preorder = preorder
          self.inorder = inorder
          return self.traverse(0,len(preorder),0,len(preorder))
#+end_src

* Make Each Node of Perfect Binary Tree "Point Right"
Link:
https://leetcode.com/problems/populating-next-right-pointers-in-each-node/
#+begin_src python
  class Node:
      def __init__(self, val: int = 0, left: 'Node' = None, right: 'Node' = None, next: 'Node' = None):
          self.val = val
          self.left = left
          self.right = right
          self.next = next
        
  def rightests(node):
      if node:
          node.next = None
          rightests(node.right)

  def inners(a,b):
      if a:
          a.next = b
          inners(a.right,b.left)

  def sibs(a,b):
      if a:
          a.next = b
          sibs(a.left,a.right)
          sibs(b.left,b.right)
          inners(a.right,b.left)

  class Solution:
      def connect(self, root: 'Optional[Node]') -> 'Optional[Node]':
          if root:
              sibs(root.left,root.right)
          rightests(root)
          return root
#+end_src

* Implement ~x^n~
I remember implementing this in SICP using tail-recursion. I applied
the same principle to come up with this iterative solution:
#+begin_src python
aclass Solution:
    def myPow(self, x: float, n: int) -> float:
        if n < 0:
            return 1/self.myPow(x,-n)
        res = 1
        while n:
            if n & 1:
                res *= x
            x *= x
            n = n >> 1
        return res
#+end_src

* Maximum Number of Colinear Points
Link: https://leetcode.com/problems/max-points-on-a-line/

The brute-force solution is somewhat clear: for each line between two
points, check how many points it hits and return the max. The tricky
part ends up being how you store a line:
#+begin_src python
class Solution:
    def maxPoints(self, points: List[List[int]]) -> int:
        if len(points) < 2:
            return len(points)
        d = {}
        dx = {}
        for i in range(len(points)):
            for j in range(i+1,len(points)):
                x1 = points[i][0]
                y1 = points[i][1]
                x2 = points[j][0]
                y2 = points[j][1]
                if x1 != x2:
                    m = (y2-y1)/(x2-x1)
                    b = y1 - m*x1
                    m2 = round(m,10)
                    b2 = round(b,10)
                    if (m2,b2) in d:
                        d[(m2,b2)] += 1
                    else:
                        d[(m2,b2)] = 1
                else:
                    if x1 in dx:
                        dx[x1] += 1
                    else:
                        dx[x1] = 1
        m1 = max(d.values()) if len(d.values()) > 0 else 0
        m2 = max(dx.values()) if len(dx.values()) > 0 else 0
        if m1 > m2:
            pair = max(d,key=d.get)
            m = pair[0]
            b = pair[1]
            tot = 0
            for k in range(len(points)):
                if math.isclose(points[k][1],m*points[k][0]+b):
                    tot += 1
            return tot
        else:
            x = max(dx,key=dx.get)
            tot = 0
            for k in range(len(points)):
                if points[k][0] == x:
                    tot += 1
            return tot
#+end_src

