coding-challenges.org
* Median of Two Sorted Arrays
Link: https://leetcode.com/problems/median-of-two-sorted-arrays/

First of all, an O(n+m) solution is easy: merge the two arrays in
O(n+m) time and return the median. But if we want a logarithmic
solution, we have to repetitively halve the problem.
    
Both are sorted, so we can binary search them "together"
somehow. Perhaps we can start with a bound on the median and tighten
it.
    
By looking through a few examples, I identified an optimal
substructure: the overall median will sit somewhere between the first
median and the second, which means we can sort of knock of half of the
array left of the lower median, and half of the array right of the
greater median. The name of the game ended up being properly
addressing edge cases:
 #+begin_src python
def getMedianSorted(l,r,n):
    # if empty, return anything
    if r <= l:
        return -42069
    i = (l+r) // 2
    m = 0
    if (r-l) % 2 == 0:
        m =  (n[i-1] + n[i]) / 2
    else:
        m = n[i]
    return m

def getMedianWithExtras(n,l,r,e):
    if (r-l) % 2 == 0:
        i = (r+l)//2 - 1
        a = sorted(n[i-len(e):i+len(e)+2]+e)
        return getMedianSorted(0,len(a),a)
    else:
        i = (r+l)//2
        a = sorted(n[i-len(e):i+len(e)+1]+e)
        return getMedianSorted(0,len(a),a)
    
class Solution:
    def getMedian(self,l1,r1,l2,r2):
        # if one is empty, we return the median of the other
        if l1 == r1:
            return getMedianSorted(l2,r2,self.nums2)
        if l2 == r2:
            return getMedianSorted(l1,r1,self.nums1)
        # next check the medians
        m1 = getMedianSorted(l1,r1,self.nums1)
        m2 = getMedianSorted(l2,r2,self.nums2)
        if m1 == m2:
            return m1
        if r1-l1 < 6 and r2-l2 < 6:
            arr = sorted(self.nums1[l1:r1]+self.nums2[l2:r2])
            return getMedianSorted(0,len(arr),arr)
        # we may get to a case where 1 array has 2 elements, which we can't reduce!
        if r1-l1 < 3:
            return getMedianWithExtras(self.nums2,l2,r2,self.nums1[l1:r1])
        if r2-l2 < 3:
            return getMedianWithExtras(self.nums1,l1,r1,self.nums2[l2:r2])
        numOutL = int((r1-l1-1)//2)
        numOutR = int((r2-l2-1)//2)
        numOut = min(numOutL,numOutR)
        if m1 < m2:
            return self.getMedian(l1+numOut,r1,l2,r2-numOut)
        else:
            return self.getMedian(l1,r1-numOut,l2+numOut,r2)
            
    def findMedianSortedArrays(self, nums1: List[int], nums2: List[int]) -> float:
        # it is given that m+n >= 1
        self.nums1 = nums1
        self.nums2 = nums2
        return self.getMedian(0,len(nums1),0,len(nums2))
#+end_src

* How many trailing zeroes in ~n!~?
Link: https://leetcode.com/problems/factorial-trailing-zeroes/
A good application for the fundamental theorem of arithmetic!
#+begin_src python
  class Solution:
      def getPrimesInFact(self,prime,fact):
          acc = 0
          i = prime
          while i <= fact:
              acc += fact // i
              i *= prime
          return acc
    
      def trailingZeroes(self, n: int) -> int:
          twos = self.getPrimesInFact(2,n)
          fives = self.getPrimesInFact(5,n)
          return min(twos,fives)
#+end_src
It wasn't until after looking at the solution that I realized that
the prime factorization of ~n!~ is always saturated with twos! The
first call to ~getPrimesInFact~ is unnecessary.
